In [1]:
import pandas as pd

In [2]:
pd.__version__

'2.2.3'

In [3]:
import pandas as pd

data = [10, 20, 30]
index = ['a', 'b', 'c']
series = pd.Series(data, index=index)
series

a    10
b    20
c    30
dtype: int64

In [4]:
data = {'Name': ['Alice', 'Bob'], 'Age': [25, 30]}
df = pd.DataFrame(data)
df

    Name  Age
0  Alice   25
1    Bob   30

In [5]:
df.head()

    Name  Age
0  Alice   25
1    Bob   30

In [6]:
df.tail()

    Name  Age
0  Alice   25
1    Bob   30

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    2 non-null      object
 1   Age     2 non-null      int64
dtypes: int64(1), object(1)
memory usage: 164.0+ bytes

In [9]:
df.describe()

             Age
count   2.000000
mean   27.500000
std     3.535534
min    25.000000
25%    26.250000
50%    27.500000
75%    28.750000
max    30.000000

In [10]:
data = {'Category': ['A', 'B', 'A', 'B'], 'Value': [10, 20, 30, 40]}
df = pd.DataFrame(data)
df.groupby('Category').sum()

          Value
Category
A            40
B            60

In [11]:
df1 = pd.DataFrame({'ID': [1, 2], 'Name': ['Alice', 'Bob']})
df2 = pd.DataFrame({'ID': [1, 2], 'Score': [90, 85]})
merged_df = pd.merge(df1, df2, on='ID')
merged_df

   ID   Name  Score
0   1  Alice     90
1   2    Bob     85

In [12]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'A': [3, 4]})
concatenated_df = pd.concat([df1, df2])
concatenated_df

   A
0  1
1  2
0  3
1  4

In [13]:
df = pd.DataFrame({'A': [10, 20, 30], 'B': [40, 50, 60]}, index=['a', 'b', 'c'])
df.loc['b', 'A']

np.int64(20)

In [15]:
df.query('A >15')

    A   B
b  20  50
c  30  60

In [16]:
df = pd.DataFrame({'A': [1, None, 3], 'B': [4, 5, None]})
df_cleaned = df.dropna()
df_cleaned

     A    B
0  1.0  4.0

In [17]:
df.fillna(0)

     A    B
0  1.0  4.0
1  0.0  5.0
2  3.0  0.0

In [18]:
df = pd.DataFrame({'A': [1, 2, 2, 3], 'B': [4, 5, 5, 6]})
df_no_duplicates = df.drop_duplicates()
df_no_duplicates

   A  B
0  1  4
1  2  5
3  3  6

In [19]:
df.rename(columns={'A': 'Alpha', 'B': 'Beta'})

   Alpha  Beta
0      1     4
1      2     5
2      2     5
3      3     6

In [21]:
df = pd.DataFrame({'ID': [1, 2], 'Math': [90, 85], 'Science': [88, 92]})
df_melted = pd.melt(df, id_vars=['ID'], var_name='Subject', value_name='Score')
df_melted

   ID  Subject  Score
0   1     Math     90
1   2     Math     85
2   1  Science     88
3   2  Science     92

In [22]:
df_melted.pivot(index='ID', columns='Subject', values='Score')

Subject  Math  Science
ID
1          90       88
2          85       92

In [26]:
df = pd.DataFrame({'A': [10, 20, 30,40, 50, 60], 'B': [40, 50, 60,70,80,90]})
df.mean()

A    35.0
B    65.0
dtype: float64

In [27]:
df.median()

A    35.0
B    65.0
dtype: float64

In [28]:
df.std()

A    18.708287
B    18.708287
dtype: float64

In [29]:
df.corr()

     A    B
A  1.0  1.0
B  1.0  1.0